[
  {
    "id": "349115",
    "title": "SmartList Wildcard Entry Box Not SmartTool Enabled When List Is Refreshable",
    "details": {
      "problem": "Users create and use many SmartPhrases and are often aware of some useful SmartLinks that help speed up their documentation. If a user is documenting with a template that has a refreshable SmartList that contains a wildcard, they can't use their useful SmartPhrases or SmartLinks on this wildcard. Instead, users have to manually type out their answer to fill out this wildcard, slowing them down.",
      "ideaForSolution": "Allow users to add SmartPhrases and SmartLinks in SmartList wildcards to speed up their documentation and allow them to take full advantage of the SmartPhrases they created.",
      "characteristics": "The SmartLinks/SmartPhrases would have to be converted into plain text and have line breaks removed from the text so that it can be used in the wildcard even if it isn't initially the right format but the SmartTools should be able to work together.",
      "smartToolsFit": "Wildcards would become more efficient in SmartLists, it would make simple smartphrases more usable, and would remove a frustration that end users encounter regularly.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points."
    }
  },
  {
    "id": "709400",
    "title": "Allow Marking User SmartPhrases as Personal/Sensitive to Hide from Other Editors",
    "details": {
      "problem": "Users might create a SmartPhrase for a signature that doesn't make sense for other people to have access to or as a personal reference that isn't meant for others to use. If other people use their private SmartPhrases, this can make them feel like their privacy has been violated or annoyed that they can't control their personal smartphrases.",
      "ideaForSolution": "Allow end users the choice to hide their SmartPhrases that aren't appropriate for others to use, preventing other users from searching or sharing SmartPhrases without the user's permission. This will make end users feel like they have control over their SmartPhrases.",
      "characteristics": "Create a button in the user SmartPhrase editor that allows it to only be searchable or viewable by editors so SmartPhrases that aren't meant to be shared don't have to be. There could also be an HDF setting to allow organizations to turn this feature off if they don't think SmartPhrases should ever be private. Private SmartPhrases should able to be changed back to public SmartPhrases at any point and vice versa, and allow it to be shared limitedly if users are added as editors so it can be shared if the owner gives permission.",
      "whyNow": "It was recently marked as a potential SPRE by a customer because they saw it as such a concern and it is regularly requested in ideas.epic.com.",
      "smartToolsFit": "It will improve effectiveness because users already have the signature SmartPhrases but it will increase trust and feelings of security if they know that their personal information can't be taken by others.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points.",
      "success": "SmartPhrases can be made private."
    }
  },
  {
    "id": "722043",
    "title": "Create Calendar SmartLink or SmartLink You Can Pick Dates From",
    "details": {
      "problem": "Users want to add dates to their notes but may not know the exact date. .reldate can pull in a date but only based on the current date so users have to look at another calendar if they want to find out what the date is 2 weeks from Friday. There are plenty of date fields with the calendar across hyperspace and other applications and it's functionality users want in their notes as well.",
      "ideaForSolution": "Users can use a calendar SmartLink that would popup an inline calendar for users to choose dates from.",
      "characteristics": "It's easy to use, doesn't require knowing about the t+1/w-2 shortcuts, and matches UI that is used across Hyperspace and other apps.",
      "whyNow": "Users have been requesting this for a long time, there are a bunch of linked SLGs and ideas.epic.com links and solving this now is better than putting it off for forever.",
      "smartToolsFit": "This improves efficiency because users don't have to open their phone or computer calendar to find the date they're looking for. The reldate parameter popup isn't particularly user friendly so picking a date from better UI would make this more of a joy to use.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points.",
      "success": "Having a SmartLink that shows a calendar to pick a date on.",
      "maintenance": "Shouldn't have much maintenance or testing costs once the SmartLink is made."
    }
  },
  {
    "id": "736777",
    "title": "Add Display Name Item for SmartText Record Lookup for Mixed Case Names in Hyperspace",
    "details": {
      "problem": "End users can have SmartTexts with the name showing where patients see the title of the SmartText, which is in all caps. There's no way to change this currently so the end user or patient will see the title of the SmartText and may feel like the name is yelling at them. This is off putting and isn't appropriate for patients to be seeing.",
      "ideaForSolution": "Allow analysts to add a display name to a SmartText so that anywhere the name of a SmartText is displayed, end users and patients can see a more readable title.",
      "characteristics": "Display name can be personalized to be end user or patient facing but should be required.",
      "smartToolsFit": "This would make the system look better and be more of a joy to use because the SmartText title wouldn't look like it was really important because it was in all caps without having an option to change it.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points."
    }
  },
  {
    "id": "803923",
    "title": "Add Highlight Functionality",
    "details": {
      "problem": "Users would copy text from an external document that has highlighting but wouldn't be able to remove the highlighting without a lot of effort. They also couldn't highlight text that they wanted to emphasize and bolding or changing word color just doesn't catch attention like highlights do.",
      "ideaForSolution": "Users can use highlighting in the STB, similar to how they use text color.",
      "characteristics": "There's already a design and DLG! It has a good outline, it just needs to be continued.",
      "whyNow": "We have been getting this request regularly, including from 4 months ago. It's a paper cut that would be a big win for lots of people if we fixed it.",
      "smartToolsFit": "It would improve efficiency with documentation by allowing users to remove highlighting they don't want without having to un-highlight in external programs or cut/paste as plain text but that would remove all other formatting too. If the highlighting is throughout a document, it's really inefficient to try to fix each individual line that has highlighting. It also would improve effectiveness of documentation because leaving in unnecessary highlighting might call attention to something while more important information for this context is skipped. It can also make the most important parts of a note or template really stand out, much more than bolding.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points.",
      "success": "Can users highlight and remove highlighting within the STB.",
      "maintenance": "Shouldn't have maintenance, might need regression testing checks when changes are made to STB accessibility or certain types of copy/pasting changes.",
      "internCandidate": false
    }
  },
  {
    "id": "1123619",
    "title": "SmartTool Admin: Add Ability to Map/Link a SmartPhrase to a SmartData Element",
    "details": {
      "problem": "Analysts add SDEs to SmartTexts and SmartLists so compliance officers can track all kinds of metrics and to pull in data for reporting. Since SmartPhrases can't have SDEs, analysts are having to build workarounds with SmartTexts in SmartLinks to allow for SDE use in SmartPhrases, requiring some analysts to spend extra time making those records. This can also prevent some analysts from adding SDEs if they don't know about this work around and compliance officers not getting all of the data they need for meaningful use analysis.",
      "ideaForSolution": "Allow analysts to add SDEs to system SmartPhrases in the SmartPhrase editor so SmartPhrases will add SDEs when end users add those SmartPhrases to their notes.",
      "characteristics": "SDEs are applied when the SmartPhrase is used, removed if the SmartPhrase text is removed, and can be used to track usage for reporting.",
      "whyNow": "It's still being requested regularly.",
      "smartToolsFit": "Make it easy to do the right thing.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points."
    }
  },
  {
    "id": "2005922",
    "title": "Prevent Parts of a Note Template from Being Deleted",
    "details": {
      "problem": "Organizational leads and compliance officers often have required SmartLists or documentation that they add for legal reasons. These sections must be filled out but end users can just delete it from any note and not have to do the documentation.",
      "ideaForSolution": "Add a SmartLink that could be used similarly to a sectioning SmartLink but nothing in that section can be deleted in the note. This allows it to be more flexible and only added to certain parts of a template. We could also make the section more like a warn on delete SmartLink so that if any part of it is about to get deleted, there is a warning saying something like 'this is required documentation, are you sure you want to delete this?' to allow more flexibility for end users. Or maybe have both options with different SmartLinks.",
      "characteristics": "Allow sections of a SmartText to be required in a note in a way that makes deleting it difficult.",
      "smartToolsFit": "This would be a part of making it easy for users to do the right thing so that required documentation is actually filled out.",
      "epicFit": "This fits ST priorities because it would solve long standing existing pain points.",
      "success": "Parts of a template can be restricted from being deleted when added to a STB."
    }
  },
  {
    "id": "2058026",
    "title": "SmartTool Editors Should Have a Preview Option",
    "details": {
      "problem": "Currently, the SmartPhrase/Link Editors do not have preview options, so end users are unable to see how the SmartTools they are creating will look when actually inserted into a SmartTextBox. It would be awesome if we provided them with a way to preview how their SmartTools would look, similar to the Barcode preview. As a physician builder who consistently creating template to be shared, I would expect SmartPhrase to has same feature that SmartText had, preview is the big one. Also a lot of organization feels SmartPhrase actually provides more flexibility and easy to update template with urgent need so they lean toward using SmartPhrase more than SmartText.",
      "ideaForSolution": "Support similar preview we did in ETX editor.",
      "characteristics": "First fill the need and ensure consistent user experience on other similar feature they familiar with. Easy to use and flexible enough.",
      "whyNow": "A long standing pain point.",
      "epicFit": "Solving existing pain points, such as ideas frequently reported during immersion, submitted through ideas.epic.com, or from other forms of feedback.",
      "success": "User satisfaction based on directly feedback/immersion. We can have feature tracking on usage of the preview feature which can be done in both POC and PRD.",
      "maintenance": "low",
      "internCandidate": true
    }
  }
]
